#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-749bEqqMjfDTtC6A

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenpmtoken_FA80209B: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D: Refreshing state... [id=cdktf-provider-aws:GH_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A: Refreshing state... [id=cdktf-provider-azurerm:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenugetapikey_795BC233: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwineusername_049CB040: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USERNAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenugetapikey_4B72CF6A: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81: Refreshing state... [id=cdktf-provider-google:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenpmtoken_9B4FF3AD: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenugetapikey_0C6A5E62: Refreshing state... [id=cdktf-provider-archive:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnameghtoken_4EE677D1: Refreshing state... [id=cdktf-provider-local:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwinepassword_1CAAF676: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwineusername_83726418: Refreshing state... [id=cdktf-provider-archive:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwinepassword_6AF1BFAC: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenpmtoken_DEA38761: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwineusername_6943A63C: Refreshing state... [id=cdktf-provider-github:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwinepassword_6A27C028: Refreshing state... [id=cdktf-provider-external:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenpmtoken_19C84FCF: Refreshing state... [id=cdktf-provider-pagerduty:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwineusername_4D61E54C: Refreshing state... [id=cdktf-provider-null:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwinepassword_12957BC9: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwineusername_2FD08746: Refreshing state... [id=cdktf-provider-aws:TWINE_USERNAME]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372: Refreshing state... [id=cdktf-provider-github:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwineusername_D4431A3B: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_USERNAME]
github_actions_secret.repos_tfcloudtoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nametfcloudtoken_5D4B526C: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenugetapikey_369EDCA6: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenpmtoken_34906B46: Refreshing state... [id=cdktf-provider-external:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwinepassword_33ED56FC: Refreshing state... [id=cdktf-provider-archive:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenugetapikey_6D07722B: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenpmtoken_5CD80167: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF: Refreshing state... [id=cdktf-provider-external:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenugetapikey_13F9475E: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenpmtoken_AFDB0F2B: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwineusername_3167ABFB: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwinepassword_CBAB489F: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenugetapikey_B157A230: Refreshing state... [id=cdktf-provider-local:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB: Refreshing state... [id=cdktf-provider-docker:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenpmtoken_37AC08DB: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwineusername_5D9D084F: Refreshing state... [id=cdktf-provider-datadog:TWINE_USERNAME]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwineusername_464237BB: Refreshing state... [id=cdktf-provider-external:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwinepassword_B5A42AA4: Refreshing state... [id=cdktf-provider-local:TWINE_PASSWORD]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwinepassword_F7EDB801: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB: Refreshing state... [id=cdktf-provider-random:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderprojectrepo014C3CE2namenpmtoken_CA780E66: Refreshing state... [id=cdktf-provider-project:NPM_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenpmtoken_4DC2E01F: Refreshing state... [id=cdktf-provider-docker:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwinepassword_1DCE070B: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nameghtoken_526ABDB8: Refreshing state... [id=cdktf-provider-archive:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwinepassword_56459168: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenugetapikey_89F31AB3: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwineusername_FB1AFDA6: Refreshing state... [id=cdktf-provider-docker:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwinepassword_8154E2FB: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE: Refreshing state... [id=cdktf-provider-null:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenugetapikey_5A6D8D97: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_actions_secret.repos_ghcommenttoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nameghcommenttoken_CD3F9953: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwineusername_E790E307: Refreshing state... [id=cdktf-provider-random:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenpmtoken_F3E5179B: Refreshing state... [id=cdktf-provider-local:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A: Refreshing state... [id=cdktf-provider-datadog:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenpmtoken_7B3206A5: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenpmtoken_2DA48D9F: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwinepassword_4BEABCCF: Refreshing state... [id=cdktf-provider-docker:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nameghtoken_8F70281E: Refreshing state... [id=cdktf-provider-pagerduty:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenugetapikey_EBF89198: Refreshing state... [id=cdktf-provider-external:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445: Refreshing state... [id=cdktf-provider-kubernetes:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenugetapikey_67D8E3E2: Refreshing state... [id=cdktf-provider-docker:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwineusername_095BADA0: Refreshing state... [id=cdktf-provider-google:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenpmtoken_38D4F0D3: Refreshing state... [id=cdktf-provider-archive:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenugetapikey_E9E6328B: Refreshing state... [id=cdktf-provider-pagerduty:NUGET_API_KEY]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenugetapikey_191ADD39: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwinepassword_1A05B3D4: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwineusername_4593AAD7: Refreshing state... [id=cdktf-provider-local:TWINE_USERNAME]
github_repository.repos_cdktfproviderazurerm_repo_19E06DC3: Refreshing state... [id=cdktf-provider-azurerm]
github_repository.repos_cdktfproviderexternal_repo_2177D259: Refreshing state... [id=cdktf-provider-external]
github_repository.repos_cdktfprovidergoogle_repo_3D7769E0: Refreshing state... [id=cdktf-provider-google]
github_repository.repos_cdktfprovidergithub_repo_66B8E54A: Refreshing state... [id=cdktf-provider-github]
github_repository.repos_cdktfproviderdocker_repo_45A47809: Refreshing state... [id=cdktf-provider-docker]
github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00: Refreshing state... [id=cdktf-provider-datadog]
github_repository.repos_cdktfrepositorymanager_repo_9D19EE52: Refreshing state... [id=cdktf-repository-manager]
github_repository.repos_cdktfproviderproject_repo_014C3CE2: Refreshing state... [id=cdktf-provider-project]
github_repository.repos_cdktfproviderlocal_repo_4D7B21AD: Refreshing state... [id=cdktf-provider-local]
github_repository.repos_cdktfprovidernull_repo_8A692B1D: Refreshing state... [id=cdktf-provider-null]
github_repository.repos_cdktfproviderarchive_repo_F28A4A49: Refreshing state... [id=cdktf-provider-archive]
github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79: Refreshing state... [id=cdktf-provider-kubernetes]
github_repository.repos_cdktfprovideraws_repo_55F46B23: Refreshing state... [id=cdktf-provider-aws]
github_repository.repos_cdktfproviderrandom_repo_448077DE: Refreshing state... [id=cdktf-provider-random]
github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3: Refreshing state... [id=cdktf-provider-pagerduty]
github_issue_label.repos_cdktfproviderazurerm_automergelabel_9D468D52: Refreshing state... [id=cdktf-provider-azurerm:automerge]
github_branch_protection.repos_cdktfproviderazurerm_mainprotection_C1C7E36E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODI=]
github_issue_label.repos_cdktfproviderexternal_automergelabel_88E85FD0: Refreshing state... [id=cdktf-provider-external:automerge]
github_branch_protection.repos_cdktfproviderexternal_mainprotection_A8EFF040: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODY=]
github_issue_label.repos_cdktfprovidergoogle_automergelabel_359F63C4: Refreshing state... [id=cdktf-provider-google:automerge]
github_branch_protection.repos_cdktfprovidergoogle_mainprotection_2D089CC1: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODA=]
github_issue_label.repos_cdktfprovidergithub_automergelabel_CB4CF729: Refreshing state... [id=cdktf-provider-github:automerge]
github_branch_protection.repos_cdktfprovidergithub_mainprotection_D33DAB1E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzY=]
github_branch_protection.repos_cdktfproviderdocker_mainprotection_BFFE8D77: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODM=]
github_issue_label.repos_cdktfproviderdocker_automergelabel_70197107: Refreshing state... [id=cdktf-provider-docker:automerge]
github_issue_label.repos_cdktfproviderdatadog_automergelabel_EBE4A0F2: Refreshing state... [id=cdktf-provider-datadog:automerge]
github_branch_protection.repos_cdktfproviderdatadog_mainprotection_BEF61ED6: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODU=]
github_issue_label.repos_cdktfrepositorymanager_automergelabel_67A6BDF7: Refreshing state... [id=cdktf-repository-manager:automerge]
github_issue_label.repos_cdktfproviderproject_automergelabel_314CBFA5: Refreshing state... [id=cdktf-provider-project:automerge]
github_branch_protection.repos_cdktfproviderlocal_mainprotection_2BB09763: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTg=]
github_issue_label.repos_cdktfproviderlocal_automergelabel_C0E7761B: Refreshing state... [id=cdktf-provider-local:automerge]
github_issue_label.repos_cdktfprovidernull_automergelabel_EAE50ED1: Refreshing state... [id=cdktf-provider-null:automerge]
github_branch_protection.repos_cdktfprovidernull_mainprotection_B3BB4873: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzQ=]
github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60: Refreshing state... [id=3949435:cdktf-provider-local]
github_team_repository.repos_cdktfproviderproject_managingteam_86F83671: Refreshing state... [id=3949435:cdktf-provider-project]
github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624: Refreshing state... [id=3949435:cdktf-repository-manager]
github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017: Refreshing state... [id=3949435:cdktf-provider-external]
github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282: Refreshing state... [id=3949435:cdktf-provider-github]
github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2: Refreshing state... [id=3949435:cdktf-provider-azurerm]
github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC: Refreshing state... [id=3949435:cdktf-provider-null]
github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1: Refreshing state... [id=3949435:cdktf-provider-datadog]
github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C: Refreshing state... [id=3949435:cdktf-provider-google]
github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0: Refreshing state... [id=3949435:cdktf-provider-docker]
github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B: Refreshing state... [id=3949435:cdktf-provider-archive]
github_branch_protection.repos_cdktfproviderarchive_mainprotection_71039C33: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTU=]
github_issue_label.repos_cdktfproviderarchive_automergelabel_869BB088: Refreshing state... [id=cdktf-provider-archive:automerge]
github_branch_protection.repos_cdktfproviderkubernetes_mainprotection_98A1BD1D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0Nzg=]
github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265: Refreshing state... [id=3949435:cdktf-provider-kubernetes]
github_issue_label.repos_cdktfproviderkubernetes_automergelabel_1FA4EB21: Refreshing state... [id=cdktf-provider-kubernetes:automerge]
github_branch_protection.repos_cdktfprovideraws_mainprotection_B7F72919: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODE=]
github_issue_label.repos_cdktfprovideraws_automergelabel_303B185E: Refreshing state... [id=cdktf-provider-aws:automerge]
github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0: Refreshing state... [id=3949435:cdktf-provider-aws]
github_issue_label.repos_cdktfproviderrandom_automergelabel_94219122: Refreshing state... [id=cdktf-provider-random:automerge]
github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5: Refreshing state... [id=3949435:cdktf-provider-random]
github_branch_protection.repos_cdktfproviderrandom_mainprotection_A087F18D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzU=]
github_branch_protection.repos_cdktfproviderpagerduty_mainprotection_18096071: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTA=]
github_issue_label.repos_cdktfproviderpagerduty_automergelabel_C6025DF6: Refreshing state... [id=cdktf-provider-pagerduty:automerge]
github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F: Refreshing state... [id=3949435:cdktf-provider-pagerduty]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideraws_managingteam_FC9AAFD0" {
      ~ etag       = "W/\"1a0f36fd1173a60ed9f8d6a8e806f0e8de5d4abd30075a4cc716bcea0420fb8a\"" -> "W/\"b39a2138a221573a2bcfdeacd860ff67296b515c54364c8dfa7ef9a640b87d40\""
        id         = "3949435:cdktf-provider-aws"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpagerduty_managingteam_26C4AF5F" {
      ~ etag       = "W/\"90a75715faf98a436bf3e7690e8e3c3e4f4a40a8bd81fdf79b096e7f6b7e2070\"" -> "W/\"ac80cdaa33ef9fc5fd760ec3633622412cb612af2b79a4691528c9b60e16ab43\""
        id         = "3949435:cdktf-provider-pagerduty"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderproject_managingteam_86F83671 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderproject_managingteam_86F83671" {
      ~ etag       = "W/\"c7bef1fc3adce8f7dfee2f3617cd69db90c962f6dc6b3cb363a1d9b199dc1c19\"" -> "W/\"c7b87f9911801df1a97162378571358499faf9a6eae2c720d19828c82cd5d1c9\""
        id         = "3949435:cdktf-provider-project"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetes_managingteam_E627D265" {
      ~ etag       = "W/\"25b12e53ee51093893ec959948c0e841d63b64a9ea335297cfcfce61c6dcf253\"" -> "W/\"cf49ab05f1361539b8e7144fff34d6e5bf496c1afbed5a2759b54cd21942466c\""
        id         = "3949435:cdktf-provider-kubernetes"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdocker_repo_45A47809 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdocker_repo_45A47809" {
      ~ etag                   = "W/\"9a3348167ee8b6a79a190e0698e626c2f7632cd7dc7514595d5ae9c109cbcc25\"" -> "W/\"e335537565b63a5c764e7b9fc161bd98486602bd4e5358877a0eaebfb47648c0\""
        id                     = "cdktf-provider-docker"
        name                   = "cdktf-provider-docker"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderarchive_repo_F28A4A49 has been changed
  ~ resource "github_repository" "repos_cdktfproviderarchive_repo_F28A4A49" {
      ~ etag                   = "W/\"051d6aae8da762117e6fcb33426673478baec810200b1e6b3f1f23fe63e31f20\"" -> "W/\"31043fa8af6ba857ed9d7e73c3efb194950ab5d92f9626ba04df281d11350f96\""
        id                     = "cdktf-provider-archive"
        name                   = "cdktf-provider-archive"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdocker_managingteam_F33627F0" {
      ~ etag       = "W/\"d0455f26caeb04a5205fab993f1f4d577e55cad827d753d420539c8cfb80757c\"" -> "W/\"65787714d42f89262e7a2bd559b449536f596d5ab551ad24db6ace1e1679f0f1\""
        id         = "3949435:cdktf-provider-docker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_managingteam_900A83BC" {
      ~ etag       = "W/\"eca76aa6806edb7e1dc13113aec659a3b92a43b7c79881f2463528293c07e9df\"" -> "W/\"b630dbf2e070b148a00377a1ab6e24a2f239ae2e680b3ab057219205e6990b38\""
        id         = "3949435:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderlocal_managingteam_0280CE60" {
      ~ etag       = "W/\"6402a6719a79a88b425978a4122e61a210c4ca5eaa2a20cdbc10e4752e8f0938\"" -> "W/\"0f0386410643c6c7fa97c46f082539f7b0119050079ad8e3f2c595b3ae72101e\""
        id         = "3949435:cdktf-provider-local"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernull_repo_8A692B1D has been changed
  ~ resource "github_repository" "repos_cdktfprovidernull_repo_8A692B1D" {
      ~ etag                   = "W/\"b2fa631ebf6d23991851f0828c97d3a090b7d8511f416b9c9eff6e2941ffe367\"" -> "W/\"7354e40e1536e8d7e19cf349b3673953b6baf51ac15e1066b1be290a5ad6826c\""
        id                     = "cdktf-provider-null"
        name                   = "cdktf-provider-null"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_managingteam_31E92624" {
      ~ etag       = "W/\"7c148dd8b7a5aa25a7b2e67cbf621ff071094f62288da371b5fb02fc8988f2f0\"" -> "W/\"d7a3c62ee15984417a0dd1b7648db2810390580054d77cce05d8ad4bbd470d67\""
        id         = "3949435:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergoogle_managingteam_9604098C" {
      ~ etag       = "W/\"df52d30eeaeeb927ee3668efe5874ca4ae032cc3e1f1ba1d97d07be168be4e8f\"" -> "W/\"a0d5bec6d7d1cf4256cf435c4116f28568fb96bb94e7cbb8e7c9efdfbb1fa3ac\""
        id         = "3949435:cdktf-provider-google"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurerm_managingteam_C1D890C2" {
      ~ etag       = "W/\"68c5b160fd0448642e9d4621c869757933defe451da783b4133cd622b7b94588\"" -> "W/\"008127f3ad817caf6a882b8a31b237ae4de9553ce931eb91c044f7a710c2fe6f\""
        id         = "3949435:cdktf-provider-azurerm"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithub_managingteam_DD2D4282" {
      ~ etag       = "W/\"37c7f395e9b2691e4b1c44c4ca79abebc797d57a44af56e16923ed3babb1d27a\"" -> "W/\"e3ff7bdce2c3460ae1c659bc1d598ea5e4f927e321b1a709c74549b5daac2f85\""
        id         = "3949435:cdktf-provider-github"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergithub_repo_66B8E54A has been changed
  ~ resource "github_repository" "repos_cdktfprovidergithub_repo_66B8E54A" {
      ~ etag                   = "W/\"8d637a9f48b2a67c296f3580806b4fc2a0ca47ca211698c6d4e27a6b471813b4\"" -> "W/\"63e6bcccb7071992e8ebae508e72787fe31e376e490471aea22a4717894df6b9\""
        id                     = "cdktf-provider-github"
        name                   = "cdktf-provider-github"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdatadog_repo_3C8DEE00" {
      ~ etag                   = "W/\"c36848107e34e558becb4344986c412a2b73149f457647b2bff97b665ac6f20e\"" -> "W/\"f4065f2413e52eeef14430cb9ef6ac239dad54e3c5a6a63f6d69f21199449d87\""
        id                     = "cdktf-provider-datadog"
        name                   = "cdktf-provider-datadog"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideraws_repo_55F46B23 has been changed
  ~ resource "github_repository" "repos_cdktfprovideraws_repo_55F46B23" {
      ~ etag                   = "W/\"b6e5e5f09aa4a7db2fb20049cd8b298c57f8c4bc5a7b09e3d9eff4677bd63395\"" -> "W/\"8da700a38865b8ae4b715e8fd7c308acbb12ac834524fde0a471beff42e869b4\""
        id                     = "cdktf-provider-aws"
        name                   = "cdktf-provider-aws"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79 has been changed
  ~ resource "github_repository" "repos_cdktfproviderkubernetes_repo_D69C3A79" {
      ~ etag                   = "W/\"ea79cf0c351cb4c94b69b2822d0d0c4f4281a3d428ea7eb3dc6835bb7920901b\"" -> "W/\"cab95fe97370f5104eb74083faa26eefbb9e58c32175fd79d151d76cecb5e288\""
        id                     = "cdktf-provider-kubernetes"
        name                   = "cdktf-provider-kubernetes"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderexternal_repo_2177D259 has been changed
  ~ resource "github_repository" "repos_cdktfproviderexternal_repo_2177D259" {
      ~ etag                   = "W/\"6227b4752ef7a4f21df4c402a91d8b87022e9c9a64dc11eb8b9a8b4c5144e31c\"" -> "W/\"1cddf6c6177ea5d193b318288db0afa755be2b1dcdeb0c37f1012639a298906b\""
        id                     = "cdktf-provider-external"
        name                   = "cdktf-provider-external"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderproject_repo_014C3CE2 has been changed
  ~ resource "github_repository" "repos_cdktfproviderproject_repo_014C3CE2" {
      ~ etag                   = "W/\"5da4b7d949911751c654ded0ea089b114dd2b5f35a9f97eee0b4d40417ab45b0\"" -> "W/\"a289812692de43838576783284b1f08da16c3c54ac400ef83345c0b2573ae1a2\""
        id                     = "cdktf-provider-project"
        name                   = "cdktf-provider-project"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpagerduty_repo_0AF36FE3" {
      ~ etag                   = "W/\"f6adbd32177a43222cd80dd6e394fb7a1db68cb188b49c8d98d3a87e87bd346f\"" -> "W/\"ca8dcfd7a165653a39fa43f52a8f51e8d8c5495e1177a6d6ae1ad746b4c1bec9\""
        id                     = "cdktf-provider-pagerduty"
        name                   = "cdktf-provider-pagerduty"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderarchive_managingteam_9F25FC7B" {
      ~ etag       = "W/\"cc8958b1f61b5fd3f05c99c3cb3024b4b88f5763cbde3433f7a9ba1f2c8b2515\"" -> "W/\"f1c8e308f8876a2b9ac769a94323ca8b6a9a3f3a96fa9c5f58e4417e8a9a92bb\""
        id         = "3949435:cdktf-provider-archive"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderlocal_repo_4D7B21AD has been changed
  ~ resource "github_repository" "repos_cdktfproviderlocal_repo_4D7B21AD" {
      ~ etag                   = "W/\"1d728c5431b128872163e2ddf5b4f8501ff28d5908e7c2f383862d14307c08f8\"" -> "W/\"b5feecdc8f01908ff9dc77980b9247e931f5c18c543e2f2112971462cba802e2\""
        id                     = "cdktf-provider-local"
        name                   = "cdktf-provider-local"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandom_managingteam_94F669F5" {
      ~ etag       = "W/\"8c7249cbaaec5f9355efe25b69b83aadcfba982c89435607fe926db109441301\"" -> "W/\"da344448f75f43278544983bd1649b9c0c7853e51bbf332ba0302f77189db5f8\""
        id         = "3949435:cdktf-provider-random"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderrandom_repo_448077DE has been changed
  ~ resource "github_repository" "repos_cdktfproviderrandom_repo_448077DE" {
      ~ etag                   = "W/\"2a33c8bae72a89b6c96c1c026bfb0a3cb0b76fe156a57641de689858c51850c6\"" -> "W/\"3568595226e639ca095f8fe4c6f4ef6bbda8cda5bb9d8d007add3bf6d90f7c5b\""
        id                     = "cdktf-provider-random"
        name                   = "cdktf-provider-random"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternal_managingteam_9DD6F017" {
      ~ etag       = "W/\"4c849c65c85c02cb4be03ba2abb0e66431987ee2ddfea624ca544ff6e8312a35\"" -> "W/\"04a043331cab0ce1fe772f4bab789ece68c4f74153779b31bc6e031f1c02a5e5\""
        id         = "3949435:cdktf-provider-external"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderazurerm_repo_19E06DC3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderazurerm_repo_19E06DC3" {
      ~ etag                   = "W/\"1e4f037dc61d8fad7c4cde1b29668fb59e4430d6f7052396baeed5a015813292\"" -> "W/\"0219be1dd9aeaa37ff55de12e43836b0ca8cbd2a1f8e2357999e71282c7f5d0f\""
        id                     = "cdktf-provider-azurerm"
        name                   = "cdktf-provider-azurerm"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfrepositorymanager_repo_9D19EE52 has been changed
  ~ resource "github_repository" "repos_cdktfrepositorymanager_repo_9D19EE52" {
      ~ etag                   = "W/\"c241352b258aa47dde630b2de7cc14fe2fcb5d422423496d8a775ea1ce881b52\"" -> "W/\"8b08d87d5cc40ed7c8b59ba4440f246e9c580e9713122d9377fe0ccdbc1a06b7\""
        id                     = "cdktf-repository-manager"
        name                   = "cdktf-repository-manager"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergoogle_repo_3D7769E0 has been changed
  ~ resource "github_repository" "repos_cdktfprovidergoogle_repo_3D7769E0" {
      ~ etag                   = "W/\"1331e816226c2cbeec3beb10ec3d5d88b43fdf8182531ba05b1c0f68edadaaf0\"" -> "W/\"5c4601c5810f8456ef16f5115037da0abf3329da68251a28bc4025cb121212d2\""
        id                     = "cdktf-provider-google"
        name                   = "cdktf-provider-google"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadog_managingteam_455152F1" {
      ~ etag       = "W/\"fea152edb2c35b6920cbea83c58ae485b86599623968bd5ac4abf5a1c0b4c50a\"" -> "W/\"d721d43f63bf7853faddd403c1c9503ced67d579d0a5446dc18bc444ca6f1b49\""
        id         = "3949435:cdktf-provider-datadog"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.repos_ghcommenttoken_secretTokenTOKEN4ghcommenttoken_0747CEEB will be created
  + resource "github_actions_secret" "repos_ghcommenttoken_secretTokenTOKEN4ghcommenttoken_0747CEEB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-repository-manager"
      + secret_name     = "GH_COMMENT_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghcommenttoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nameghcommenttoken_CD3F9953 will be destroyed
  - resource "github_actions_secret" "repos_ghcommenttoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nameghcommenttoken_CD3F9953" {
      - created_at      = "2021-08-09 20:48:49 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-repository-manager:GH_COMMENT_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-repository-manager" -> null
      - secret_name     = "GH_COMMENT_TOKEN" -> null
      - updated_at      = "2021-08-09 20:48:49 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN101ghtoken_206D97B4 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN101ghtoken_206D97B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-external"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN112ghtoken_DDEE0DC6 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN112ghtoken_DDEE0DC6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN123ghtoken_E2BCAB30 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN123ghtoken_E2BCAB30" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-random"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN134ghtoken_66D54D28 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN134ghtoken_66D54D28" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN13ghtoken_A4239919 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN13ghtoken_A4239919" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN145ghtoken_3E37EDB9 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN145ghtoken_3E37EDB9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN156ghtoken_7040BBF3 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN156ghtoken_7040BBF3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN24ghtoken_BA8B3BD8 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN24ghtoken_BA8B3BD8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-google"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN35ghtoken_AD3B449E will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN35ghtoken_AD3B449E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN46ghtoken_6FE2C725 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN46ghtoken_6FE2C725" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN57ghtoken_8189AF24 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN57ghtoken_8189AF24" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-null"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN68ghtoken_6A395554 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN68ghtoken_6A395554" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-kubernetes"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN79ghtoken_6170DE4F will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN79ghtoken_6170DE4F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-docker"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretTokenTOKEN90ghtoken_D494DAA8 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretTokenTOKEN90ghtoken_D494DAA8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-github"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nameghtoken_526ABDB8 will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nameghtoken_526ABDB8" {
      - created_at      = "2021-08-13 15:02:49 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-archive:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-archive" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-13 15:02:49 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D" {
      - created_at      = "2021-08-11 14:27:48 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-aws:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-aws" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:48 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A" {
      - created_at      = "2021-08-11 14:27:46 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-azurerm:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-azurerm" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:46 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A" {
      - created_at      = "2021-08-11 14:27:44 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-datadog:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-datadog" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:44 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB" {
      - created_at      = "2021-08-11 14:27:49 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-docker:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-docker" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:49 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF" {
      - created_at      = "2021-08-11 14:27:39 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-external:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-external" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:39 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372 will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372" {
      - created_at      = "2021-08-11 14:27:40 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-github:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-github" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:40 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81 will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81" {
      - created_at      = "2021-08-11 14:27:45 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-google:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-google" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:45 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445 will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445" {
      - created_at      = "2021-08-11 14:27:43 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-kubernetes:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-kubernetes" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:43 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnameghtoken_4EE677D1 will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnameghtoken_4EE677D1" {
      - created_at      = "2021-08-13 15:02:59 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-local:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-local" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-13 15:02:59 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE" {
      - created_at      = "2021-08-11 14:27:50 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-null:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-null" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-11 14:27:50 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nameghtoken_8F70281E will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nameghtoken_8F70281E" {
      - created_at      = "2021-08-13 15:02:32 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-pagerduty:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-pagerduty" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-13 15:02:32 +0000 UTC" -> null
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB will be destroyed
  - resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB" {
      - created_at      = "2021-08-13 08:50:47 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-random:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-random" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2021-08-13 08:50:47 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN102npmtoken_9F199FDC will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN102npmtoken_9F199FDC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-external"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN113npmtoken_37D9AEE1 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN113npmtoken_37D9AEE1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN124npmtoken_1FF0BEE7 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN124npmtoken_1FF0BEE7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-random"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN135npmtoken_9D54C20D will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN135npmtoken_9D54C20D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN146npmtoken_C77F3F46 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN146npmtoken_C77F3F46" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN14npmtoken_97D8ACB3 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN14npmtoken_97D8ACB3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN157npmtoken_996E83C3 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN157npmtoken_996E83C3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN25npmtoken_B4BB4E78 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN25npmtoken_B4BB4E78" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-google"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN36npmtoken_4518A4A2 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN36npmtoken_4518A4A2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN47npmtoken_30CF47C0 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN47npmtoken_30CF47C0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN58npmtoken_AA5049C3 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN58npmtoken_AA5049C3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-null"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN69npmtoken_C103158D will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN69npmtoken_C103158D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-kubernetes"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN80npmtoken_4219BE6C will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN80npmtoken_4219BE6C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-docker"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN8npmtoken_F51DB77C will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN8npmtoken_F51DB77C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-project"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretTokenTOKEN91npmtoken_8DA176B6 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretTokenTOKEN91npmtoken_8DA176B6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-github"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenpmtoken_38D4F0D3 will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenpmtoken_38D4F0D3" {
      - created_at      = "2021-08-13 15:02:44 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-archive:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-archive" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-13 15:02:44 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenpmtoken_DEA38761 will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenpmtoken_DEA38761" {
      - created_at      = "2021-08-06 21:20:23 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-aws:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-aws" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:20:23 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenpmtoken_2DA48D9F will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenpmtoken_2DA48D9F" {
      - created_at      = "2021-08-06 21:20:31 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-azurerm:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-azurerm" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:20:31 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenpmtoken_37AC08DB will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenpmtoken_37AC08DB" {
      - created_at      = "2021-08-06 21:20:42 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-datadog:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-datadog" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:20:42 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenpmtoken_4DC2E01F will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenpmtoken_4DC2E01F" {
      - created_at      = "2021-08-06 21:21:10 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-docker:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-docker" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:21:10 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenpmtoken_34906B46 will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenpmtoken_34906B46" {
      - created_at      = "2021-08-06 21:20:50 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-external:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-external" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:20:50 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenpmtoken_9B4FF3AD will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenpmtoken_9B4FF3AD" {
      - created_at      = "2021-08-06 21:20:39 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-github:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-github" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:20:39 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenpmtoken_FA80209B will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenpmtoken_FA80209B" {
      - created_at      = "2021-08-06 21:20:55 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-google:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-google" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:20:55 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenpmtoken_7B3206A5 will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenpmtoken_7B3206A5" {
      - created_at      = "2021-08-06 21:21:07 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-kubernetes:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-kubernetes" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:21:07 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenpmtoken_F3E5179B will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenpmtoken_F3E5179B" {
      - created_at      = "2021-08-13 15:02:55 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-local:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-local" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-13 15:02:55 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenpmtoken_5CD80167 will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenpmtoken_5CD80167" {
      - created_at      = "2021-08-06 21:21:00 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-null:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-null" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-06 21:21:00 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenpmtoken_19C84FCF will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenpmtoken_19C84FCF" {
      - created_at      = "2021-08-13 15:02:38 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-pagerduty:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-pagerduty" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-13 15:02:38 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderprojectrepo014C3CE2namenpmtoken_CA780E66 will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderprojectrepo014C3CE2namenpmtoken_CA780E66" {
      - created_at      = "2021-08-12 09:25:02 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-project:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-project" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-12 09:25:02 +0000 UTC" -> null
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenpmtoken_AFDB0F2B will be destroyed
  - resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenpmtoken_AFDB0F2B" {
      - created_at      = "2021-08-13 08:50:49 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-random:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-random" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2021-08-13 08:50:49 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN103nugetapikey_187BB96C will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN103nugetapikey_187BB96C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-external"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN114nugetapikey_35D3A6B4 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN114nugetapikey_35D3A6B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN125nugetapikey_A36D5F6B will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN125nugetapikey_A36D5F6B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-random"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN136nugetapikey_1ADCA15F will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN136nugetapikey_1ADCA15F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN147nugetapikey_C91B9E7C will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN147nugetapikey_C91B9E7C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN158nugetapikey_93612C20 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN158nugetapikey_93612C20" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN15nugetapikey_8C6800DE will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN15nugetapikey_8C6800DE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN26nugetapikey_737D3B22 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN26nugetapikey_737D3B22" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-google"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN37nugetapikey_1C970F50 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN37nugetapikey_1C970F50" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN48nugetapikey_71041956 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN48nugetapikey_71041956" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN59nugetapikey_B3494036 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN59nugetapikey_B3494036" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-null"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN70nugetapikey_922AA448 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN70nugetapikey_922AA448" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-kubernetes"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN81nugetapikey_FE2F2E58 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN81nugetapikey_FE2F2E58" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-docker"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretTokenTOKEN92nugetapikey_F0F3F9F9 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretTokenTOKEN92nugetapikey_F0F3F9F9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-github"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenugetapikey_0C6A5E62 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenugetapikey_0C6A5E62" {
      - created_at      = "2021-08-13 15:02:45 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-archive:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-archive" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-13 15:02:45 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenugetapikey_13F9475E will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenugetapikey_13F9475E" {
      - created_at      = "2021-08-06 21:20:26 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-aws:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-aws" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:20:26 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenugetapikey_6D07722B will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenugetapikey_6D07722B" {
      - created_at      = "2021-08-06 21:20:27 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-azurerm:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-azurerm" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:20:27 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenugetapikey_89F31AB3 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenugetapikey_89F31AB3" {
      - created_at      = "2021-08-06 21:20:41 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-datadog:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-datadog" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:20:41 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenugetapikey_67D8E3E2 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenugetapikey_67D8E3E2" {
      - created_at      = "2021-08-06 21:21:09 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-docker:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-docker" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:21:09 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenugetapikey_EBF89198 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenugetapikey_EBF89198" {
      - created_at      = "2021-08-06 21:20:45 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-external:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-external" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:20:45 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenugetapikey_795BC233 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenugetapikey_795BC233" {
      - created_at      = "2021-08-06 21:20:36 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-github:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-github" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:20:36 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenugetapikey_5A6D8D97 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenugetapikey_5A6D8D97" {
      - created_at      = "2021-08-06 21:20:54 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-google:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-google" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:20:54 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenugetapikey_191ADD39 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenugetapikey_191ADD39" {
      - created_at      = "2021-08-06 21:21:01 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-kubernetes:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-kubernetes" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:21:01 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenugetapikey_B157A230 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenugetapikey_B157A230" {
      - created_at      = "2021-08-13 15:02:53 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-local:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-local" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-13 15:02:53 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenugetapikey_369EDCA6 will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenugetapikey_369EDCA6" {
      - created_at      = "2021-08-06 21:20:56 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-null:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-null" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-06 21:20:56 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenugetapikey_E9E6328B will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenugetapikey_E9E6328B" {
      - created_at      = "2021-08-13 15:02:39 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-pagerduty:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-pagerduty" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-13 15:02:39 +0000 UTC" -> null
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenugetapikey_4B72CF6A will be destroyed
  - resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenugetapikey_4B72CF6A" {
      - created_at      = "2021-08-13 08:50:50 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-random:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-random" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2021-08-13 08:50:50 +0000 UTC" -> null
    }

  # github_actions_secret.repos_tfcloudtoken_secretTokenTOKEN3tfcloudtoken_74CA6674 will be created
  + resource "github_actions_secret" "repos_tfcloudtoken_secretTokenTOKEN3tfcloudtoken_74CA6674" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-repository-manager"
      + secret_name     = "TF_CLOUD_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_tfcloudtoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nametfcloudtoken_5D4B526C will be destroyed
  - resource "github_actions_secret" "repos_tfcloudtoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nametfcloudtoken_5D4B526C" {
      - created_at      = "2021-08-06 21:39:03 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-repository-manager:TF_CLOUD_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-repository-manager" -> null
      - secret_name     = "TF_CLOUD_TOKEN" -> null
      - updated_at      = "2021-08-06 21:39:03 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN105twinepassword_70580BF5 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN105twinepassword_70580BF5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-external"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN116twinepassword_5B87F8E7 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN116twinepassword_5B87F8E7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN127twinepassword_A7B46CE6 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN127twinepassword_A7B46CE6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-random"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN138twinepassword_E30123F9 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN138twinepassword_E30123F9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN149twinepassword_88C40C90 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN149twinepassword_88C40C90" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN160twinepassword_3E257E34 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN160twinepassword_3E257E34" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN17twinepassword_E0C106CF will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN17twinepassword_E0C106CF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN28twinepassword_9210D279 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN28twinepassword_9210D279" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-google"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN39twinepassword_0EAA516F will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN39twinepassword_0EAA516F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN50twinepassword_52E161FE will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN50twinepassword_52E161FE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN61twinepassword_0F28A859 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN61twinepassword_0F28A859" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-null"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN72twinepassword_3B5C201C will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN72twinepassword_3B5C201C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-kubernetes"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN83twinepassword_BDBE3EED will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN83twinepassword_BDBE3EED" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-docker"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretTokenTOKEN94twinepassword_B9A9C96F will be created
  + resource "github_actions_secret" "repos_twinepassword_secretTokenTOKEN94twinepassword_B9A9C96F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-github"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwinepassword_33ED56FC will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwinepassword_33ED56FC" {
      - created_at      = "2021-08-13 15:02:52 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-archive:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-archive" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-13 15:02:52 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwinepassword_56459168 will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwinepassword_56459168" {
      - created_at      = "2021-08-06 21:20:22 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-aws:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-aws" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:20:22 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwinepassword_8154E2FB will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwinepassword_8154E2FB" {
      - created_at      = "2021-08-06 21:20:28 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-azurerm:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-azurerm" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:20:28 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwinepassword_1A05B3D4 will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwinepassword_1A05B3D4" {
      - created_at      = "2021-08-06 21:20:40 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-datadog:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-datadog" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:20:40 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwinepassword_4BEABCCF will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwinepassword_4BEABCCF" {
      - created_at      = "2021-08-06 21:21:11 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-docker:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-docker" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:21:11 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwinepassword_6A27C028 will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwinepassword_6A27C028" {
      - created_at      = "2021-08-06 21:20:47 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-external:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-external" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:20:47 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwinepassword_1DCE070B will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwinepassword_1DCE070B" {
      - created_at      = "2021-08-06 21:20:37 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-github:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-github" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:20:37 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwinepassword_6AF1BFAC will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwinepassword_6AF1BFAC" {
      - created_at      = "2021-08-06 21:20:53 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-google:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-google" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:20:53 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwinepassword_CBAB489F will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwinepassword_CBAB489F" {
      - created_at      = "2021-08-06 21:21:06 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-kubernetes:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-kubernetes" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:21:06 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwinepassword_B5A42AA4 will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwinepassword_B5A42AA4" {
      - created_at      = "2021-08-13 15:03:02 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-local:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-local" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-13 15:03:02 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwinepassword_1CAAF676 will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwinepassword_1CAAF676" {
      - created_at      = "2021-08-06 21:20:58 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-null:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-null" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-06 21:20:58 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwinepassword_F7EDB801 will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwinepassword_F7EDB801" {
      - created_at      = "2021-08-13 15:02:33 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-pagerduty:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-pagerduty" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-13 15:02:33 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwinepassword_12957BC9 will be destroyed
  - resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwinepassword_12957BC9" {
      - created_at      = "2021-08-13 08:50:52 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-random:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-random" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2021-08-13 08:50:52 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN104twineusername_84FA9182 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN104twineusername_84FA9182" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-external"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN115twineusername_AF729F20 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN115twineusername_AF729F20" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN126twineusername_3B0849ED will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN126twineusername_3B0849ED" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-random"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN137twineusername_28E6A291 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN137twineusername_28E6A291" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN148twineusername_E9549056 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN148twineusername_E9549056" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN159twineusername_83128567 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN159twineusername_83128567" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN16twineusername_D52521BB will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN16twineusername_D52521BB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN27twineusername_652C4E4A will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN27twineusername_652C4E4A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-google"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN38twineusername_52165816 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN38twineusername_52165816" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN49twineusername_2D316A71 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN49twineusername_2D316A71" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN60twineusername_86E1C441 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN60twineusername_86E1C441" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-null"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN71twineusername_50FE6512 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN71twineusername_50FE6512" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-kubernetes"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN82twineusername_8571C4F9 will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN82twineusername_8571C4F9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-docker"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretTokenTOKEN93twineusername_B6C05EAA will be created
  + resource "github_actions_secret" "repos_twineusername_secretTokenTOKEN93twineusername_B6C05EAA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-github"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwineusername_83726418 will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwineusername_83726418" {
      - created_at      = "2021-08-13 15:02:51 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-archive:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-archive" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-13 15:02:51 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwineusername_2FD08746 will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwineusername_2FD08746" {
      - created_at      = "2021-08-12 22:01:23 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-aws:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-aws" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:23 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwineusername_049CB040 will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwineusername_049CB040" {
      - created_at      = "2021-08-12 22:01:21 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-azurerm:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-azurerm" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:21 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwineusername_5D9D084F will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwineusername_5D9D084F" {
      - created_at      = "2021-08-12 22:01:20 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-datadog:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-datadog" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:20 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwineusername_FB1AFDA6 will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwineusername_FB1AFDA6" {
      - created_at      = "2021-08-12 22:01:16 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-docker:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-docker" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:16 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwineusername_464237BB will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwineusername_464237BB" {
      - created_at      = "2021-08-12 22:01:18 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-external:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-external" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:18 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwineusername_6943A63C will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwineusername_6943A63C" {
      - created_at      = "2021-08-12 22:01:19 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-github:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-github" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:19 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwineusername_095BADA0 will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwineusername_095BADA0" {
      - created_at      = "2021-08-12 22:01:24 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-google:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-google" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:24 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwineusername_3167ABFB will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwineusername_3167ABFB" {
      - created_at      = "2021-08-12 22:01:15 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-kubernetes:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-kubernetes" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:15 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwineusername_4593AAD7 will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwineusername_4593AAD7" {
      - created_at      = "2021-08-13 15:02:56 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-local:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-local" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-13 15:02:56 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwineusername_4D61E54C will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwineusername_4D61E54C" {
      - created_at      = "2021-08-12 22:01:12 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-null:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-null" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-12 22:01:12 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwineusername_D4431A3B will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwineusername_D4431A3B" {
      - created_at      = "2021-08-13 15:02:34 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-pagerduty:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-pagerduty" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-13 15:02:34 +0000 UTC" -> null
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwineusername_E790E307 will be destroyed
  - resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwineusername_E790E307" {
      - created_at      = "2021-08-13 08:50:51 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-random:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-random" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2021-08-13 08:50:51 +0000 UTC" -> null
    }

  # github_branch_protection.repos_cdktfproviderazuread_mainprotection_F5F1D327 will be created
  + resource "github_branch_protection" "repos_cdktfproviderazuread_mainprotection_F5F1D327" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-azuread"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = true
        }
    }

  # github_issue_label.repos_cdktfproviderazuread_automergelabel_08BC2A82 will be created
  + resource "github_issue_label" "repos_cdktfproviderazuread_automergelabel_08BC2A82" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-azuread"
      + url        = (known after apply)
    }

  # github_repository.repos_cdktfproviderazuread_repo_A398ECE6 will be created
  + resource "github_repository" "repos_cdktfproviderazuread_repo_A398ECE6" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for azuread."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-azuread"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "azuread",
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_team_repository.repos_cdktfproviderazuread_managingteam_0135A009 will be created
  + resource "github_team_repository" "repos_cdktfproviderazuread_managingteam_0135A009" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-azuread"
      + team_id    = "3949435"
    }

Plan: 77 to add, 0 to change, 68 to destroy.

Changes to Outputs:
  ~ repos_providerRepos_C7679B58 = [
        # (2 unchanged elements hidden)
        "git@github.com:hashicorp/cdktf-provider-azurerm.git",
      + (known after apply),
        "git@github.com:hashicorp/cdktf-provider-null.git",
        # (9 unchanged elements hidden)
    ]
```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*